Tekla Open API Reference for Tekla Structures 2025
ClashCheckData.Object2 Property
 Gets the second clashing object.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ModelObject Object2 { get; }
Public ReadOnly Property Object2 As ModelObject
	Get
Property Value
Type: ModelObject
See Also
Reference
ClashCheckData Class
Tekla.Structures.Model Namespace